Revit 2027 API
ParameterTypeId.SpatialFieldMgrLegendTextType Property
 "Overall Legend Text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpatialFieldMgrLegendTextType { get; }
Public Shared ReadOnly Property SpatialFieldMgrLegendTextType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpatialFieldMgrLegendTextType {
	ForgeTypeId^ get ();
}
static member SpatialFieldMgrLegendTextType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace